public class Main {
    public static void main(String[] args) {
        //Task 1----------------------------------------------------------------------------------------
        int b = 11;
        int c = 6;
        int a = 4 * (b + c + 1) / 2;
        System.out.print("Ответ: " + a);
        //Task 2----------------------------------------------------------------------------------------
//        int a = 97;
//        int b = a % 10;
//        int sum = b + a / 10;
//        System.out.print("Ответ: " + sum);
        //Task 3----------------------------------------------------------------------------------------
//        int a = 137;
//        int b = a / 10;
//        int c = b % 10;
//        int sum = a / 100 + a % 10 + c;
//        System.out.print("Ответ: " + sum);
        //Task 4----------------------------------------------------------------------------------------
//        double a = 9.4334534;
//        int res = (int) (a + 0.5);
//        System.out.println("Ответ: " + res);
        //Task 5----------------------------------------------------------------------------------------
//        int q = 21;
//        int w = 8;
//        int a = q / w;
//        int b = q % w;
//        System.out.println("Ответ: " + a + " и " + b + " в остатке.");
        //Task 6----------------------------------------------------------------------------------------
//        int seconds = 10943;
//        int hours = seconds / 3600;
//        int minutes = (seconds % 3600) / 60;
//        seconds = seconds % 60;
//        System.out.println("Ответ: " + hours + ":" + minutes + ":" + seconds);
        //Task 7----------------------------------------------------------------------------------------
//        int number = 21;
//        int a = number / 10;
//        int b = number % 10;
//        System.out.println("Ответ: " + b + a);
    }
}